-- phpMyAdmin SQL Dump
-- version 5.0.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Feb 14, 2020 at 11:25 PM
-- Server version: 10.3.22-MariaDB
-- PHP Version: 7.2.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `smomscic_klongri`
--

-- --------------------------------------------------------

--
-- Table structure for table `activities`
--

CREATE TABLE `activities` (
  `id` int(11) NOT NULL,
  `subject` varchar(255) NOT NULL,
  `sub_title` varchar(255) NOT NULL,
  `detail` text NOT NULL,
  `image` varchar(255) NOT NULL,
  `status` enum('true','false') NOT NULL DEFAULT 'true',
  `datetime` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `activities`
--

INSERT INTO `activities` (`id`, `subject`, `sub_title`, `detail`, `image`, `status`, `datetime`) VALUES
(1, 'กิจกรรมที่ 1', 'วันที่ 16 มิถุนายน 2562 โรงเรียนชาวนาบ้านคลองรี่ ร่วมงานการพัฒนางานวิจัย', '<p><span style=\"font-size:small\"><span style=\"font-family:Arial,Helvetica,sans-serif\"><span style=\"background-color:#ffffff\">วันที่ 16 มิถุนายน 2562 โรงเรียนชาวนาบ้านคลองรี่ ร่วมงานการพัฒนางานวิจัย</span></span></span></p>\r\n\r\n<div style=\"-webkit-text-stroke-width:0px; text-align:start; text-indent:0px\"><span style=\"font-size:small\"><span style=\"font-family:Arial,Helvetica,sans-serif\"><span style=\"background-color:#ffffff\">กับทีมนักวิจัยของมหาวิทยาลัยราชภัฏจันทรเกษม&nbsp;โดยมี ศ.ดร. พรรณ๊ บัวเล็ก เป็นหัวหน้าโครงการ ร่วมด้วย ดร.สุพรรณี ปลัดศรีช่วย และ ดร.วิจิตร จารุโณประถัมภ์</span></span></span></div>\r\n\r\n<div style=\"-webkit-text-stroke-width:0px; text-align:start; text-indent:0px\">&nbsp;</div>\r\n\r\n<div style=\"-webkit-text-stroke-width:0px; text-align:center; text-indent:0px\"><img alt=\"\" class=\"img-fluid\" src=\"https://klongri-ffs.com/klongri/admin/assets/images/source/%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%201/C%2001.jpg\" style=\"height:100%; width:100%\" /></div>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><img alt=\"\" class=\"img-fluid\" src=\"https://klongri-ffs.com/klongri/admin/assets/images/source/%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%201/C%2002.jpg\" style=\"height:100%; width:100%\" /></p>\r\n\r\n<p style=\"text-align:center\">&nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><img alt=\"\" class=\"img-fluid\" src=\"https://klongri-ffs.com/klongri/admin/assets/images/source/%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%201/C%2003.jpg\" style=\"height:100%; width:100%\" /></p>\r\n\r\n<p style=\"text-align:center\">&nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><img alt=\"\" class=\"img-fluid\" src=\"https://klongri-ffs.com/klongri/admin/assets/images/source/%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%201/C%2008.jpg\" style=\"height:100%; width:100%\" /></p>\r\n', 'klongri_102961931920191117_002328.jpg', 'true', '2019-11-16 17:23:28'),
(2, 'กิจกรรมที่ 2', 'ระหว่างวันที่ 26-27 สิงหาคม 2562 ไปศึกษาดูงาน ณ นาบุญข้าวหอม', '<p>ระหว่างวันที่&nbsp;26-27&nbsp;สิงหาคม&nbsp;2562&nbsp;ไปศึกษาดูงาน ณ นาบุญข้าวหอม และโครงการศึกษาวิจัยและพัฒนาสิ่งแวดล้อมอันเนื่องมาจากพระราชดำริ ตำบลแหลมผักเบี้ย อำเภอบ้านแหลม จังหวัดเพชรบุรี&nbsp;ร่วมกับเกษตรอำเภอสรรคบุรี และทีมนักวิจัยมหาวิทยาลัยราชภัฏจันทรเกษม&nbsp; &nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><img alt=\"\" class=\"img-fluid\" src=\"https://www.klongri-ffs.com/klongri/admin/assets/images/source/%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%202/Pet%2011.jpg\" style=\"height:100%; width:100%\" /></p>\r\n\r\n<p style=\"text-align:center\">&nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><img alt=\"\" class=\"img-fluid\" src=\"https://www.klongri-ffs.com/klongri/admin/assets/images/source/%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%202/Pet%2014.jpg\" style=\"height:100%; width:100%\" /></p>\r\n\r\n<p style=\"text-align:center\">&nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><img alt=\"\" class=\"img-fluid\" src=\"https://www.klongri-ffs.com/klongri/admin/assets/images/source/%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%202/Pet%2021.jpg\" style=\"height:100%; width:100%\" /></p>\r\n\r\n<p style=\"text-align:center\">&nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><img alt=\"\" class=\"img-fluid\" src=\"https://www.klongri-ffs.com/klongri/admin/assets/images/source/%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%202/Pet%2023.jpg\" style=\"height:100%; width:100%\" /></p>\r\n', 'klongri_130538075420191117_004056.jpg', 'true', '2019-11-16 17:40:56'),
(3, 'กิจกรรมที่ 3', 'วันที่ 19 กันยายน 2562 ร่วมกิจกรรมสนทนากลุ่ม', '<p>วันที่ 19 กันยายน 2562 ร่วมกิจกรรมสนทนากลุ่มเรื่อง แนวทางการพัฒนาหลักสูตร และการบริหารจัดการโรงเรียนชาวนา ณ ศูนย์การศึกษามหาวิทยาลัยราชภัฏจันทรเกษม-ชัยนาท มี ผู้ช่วยศาสตราจารย์ ดร. สถาพร ถาวรอธิวาสน์ นางละมูล จันทร์วงค์ และนายสุนทร มณฑา เป็นวิทยากรเสวนา โดยมี ดร.วิจิตร จารุโณประถัมภ์ ดำเนินรายการ</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><img alt=\"\" class=\"img-fluid\" src=\"https://www.klongri-ffs.com/klongri/admin/assets/images/source/%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%203/H%2001.jpg\" style=\"height:100%; width:100%\" /></p>\r\n\r\n<p style=\"text-align:center\">&nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><img alt=\"\" class=\"img-fluid\" src=\"https://www.klongri-ffs.com/klongri/admin/assets/images/source/%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%203/H%2003.jpg\" style=\"height:100%; width:100%\" /></p>\r\n\r\n<p style=\"text-align:center\">&nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><img alt=\"\" class=\"img-fluid\" src=\"https://www.klongri-ffs.com/klongri/admin/assets/images/source/%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%203/H%2007.jpg\" style=\"height:100%; width:100%\" /></p>\r\n\r\n<p style=\"text-align:center\">&nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><img alt=\"\" class=\"img-fluid\" src=\"https://www.klongri-ffs.com/klongri/admin/assets/images/source/%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%203/H%2008.jpg\" style=\"height:100%; width:100%\" /></p>\r\n', 'klongri_58003920420191117_004507.jpg', 'true', '2019-11-16 17:45:07');

-- --------------------------------------------------------

--
-- Table structure for table `activities_ip`
--

CREATE TABLE `activities_ip` (
  `id` int(11) NOT NULL,
  `ref_id_activities` int(11) NOT NULL,
  `REMOTE_ADDR` varchar(255) COLLATE utf8_bin NOT NULL,
  `HTTP_USER_AGENT` text COLLATE utf8_bin NOT NULL,
  `DATETIME` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Dumping data for table `activities_ip`
--

INSERT INTO `activities_ip` (`id`, `ref_id_activities`, `REMOTE_ADDR`, `HTTP_USER_AGENT`, `DATETIME`) VALUES
(1, 1, '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.97 Safari/537.36', '2019-11-16 17:26:25'),
(2, 1, '171.7.71.159', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.97 Safari/537.36', '2019-11-16 17:32:39'),
(3, 2, '171.7.71.159', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.97 Safari/537.36', '2019-11-16 17:41:07'),
(4, 3, '171.7.71.159', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.97 Safari/537.36', '2019-11-16 17:45:17'),
(5, 1, '171.7.71.159', 'Mozilla/5.0 (Linux; Android 8.1.0; vivo 1716) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.96 Mobile Safari/537.36', '2019-11-17 03:00:19'),
(6, 2, '171.7.71.159', 'Mozilla/5.0 (Linux; Android 8.1.0; vivo 1716) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.96 Mobile Safari/537.36', '2019-11-17 03:00:30'),
(7, 1, '171.6.166.29', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.97 Safari/537.36', '2019-11-17 16:40:01'),
(8, 1, '171.6.166.29', 'Mozilla/5.0 (Linux; Android 8.1.0; vivo 1716) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.96 Mobile Safari/537.36', '2019-11-17 16:40:26'),
(9, 2, '171.6.166.29', 'Mozilla/5.0 (Linux; Android 8.1.0; vivo 1716) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.96 Mobile Safari/537.36', '2019-11-17 16:40:41'),
(10, 2, '171.6.166.29', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.97 Safari/537.36', '2019-11-17 16:42:25'),
(11, 1, '171.6.166.29', 'Mozilla/5.0 (Linux; Android 8.1.0; vivo 1716) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.96 Mobile Safari/537.36', '2019-11-17 16:56:07'),
(12, 1, '171.6.166.29', 'Mozilla/5.0 (Linux; Android 8.1.0; vivo 1716) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.96 Mobile Safari/537.36', '2019-11-18 01:13:45'),
(13, 1, '182.232.29.250', 'Mozilla/5.0 (Linux; Android 8.1.0; vivo 1716) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.96 Mobile Safari/537.36', '2019-11-18 02:18:15'),
(14, 3, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:00:04'),
(15, 2, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:00:05'),
(16, 1, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:00:06'),
(17, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:02'),
(18, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:02'),
(19, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:02'),
(20, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:03'),
(21, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:03'),
(22, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:04'),
(23, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:04'),
(24, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:04'),
(25, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:04'),
(26, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:04'),
(27, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:05'),
(28, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:05'),
(29, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:06'),
(30, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:06'),
(31, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:12'),
(32, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:31'),
(33, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:31'),
(34, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:31'),
(35, 1, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:31'),
(36, 3, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:31'),
(37, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:43'),
(38, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:43'),
(39, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:44'),
(40, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:44'),
(41, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:44'),
(42, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:44'),
(43, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:45'),
(44, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:46'),
(45, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:46'),
(46, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:47'),
(47, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:48'),
(48, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:04:01'),
(49, -1, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:04:31'),
(50, -1, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:04:32'),
(51, -1, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:04:32'),
(52, 3, '66.249.64.146', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-11-20 06:31:38'),
(53, 3, '202.151.41.77', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36', '2019-11-26 07:44:31'),
(54, 2, '202.151.41.77', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36', '2019-11-26 07:45:08'),
(55, 1, '202.151.41.77', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36', '2019-11-26 07:45:39'),
(56, 1, '202.151.41.77', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36', '2019-11-26 07:58:43'),
(57, 2, '202.151.41.77', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36', '2019-11-26 07:59:15'),
(58, 3, '202.151.41.77', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36', '2019-11-26 07:59:53'),
(59, 1, '202.151.41.41', 'Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36', '2019-11-27 08:35:02'),
(60, 3, '202.151.41.253', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36', '2019-12-02 01:36:09'),
(61, 3, '192.99.225.97', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.102 Safari/537.36', '2019-12-14 06:20:30'),
(62, 2, '192.99.225.97', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/64.0.3282.140 Safari/537.36 Edge/17.17134', '2019-12-14 06:20:38'),
(63, 2, '66.249.64.150', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-12-18 04:09:49'),
(64, 1, '66.249.64.150', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-12-18 13:09:25'),
(65, 1, '114.5.252.210', 'Mozilla/5.0 (Linux; Android 4.4.2; ASUS_T00J) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.62 Mobile Safari/537.36', '2019-12-29 20:39:12'),
(66, 3, '104.238.250.88', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87 Safari/537.36', '2019-12-31 07:51:50'),
(67, 2, '104.238.250.88', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87 Safari/537.36', '2019-12-31 07:51:52'),
(68, 1, '104.238.250.88', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87 Safari/537.36', '2019-12-31 07:51:54'),
(69, 3, '184.168.46.103', 'Opera/9.00 (Windows NT 5.1; U; en)', '2019-12-31 17:08:52'),
(70, 2, '184.168.46.103', 'Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; .NET CLR 1.1.4322; .NET CLR 2.0.50727; .NET CLR 3.0.04506.30)', '2019-12-31 17:32:47'),
(71, 3, '109.199.100.241', '', '2020-01-01 14:25:07'),
(72, 2, '150.95.9.221', 'OreOreAgent', '2020-01-01 14:28:06'),
(73, 1, '150.95.9.221', 'OreOreAgent', '2020-01-01 14:32:14'),
(74, 2, '66.249.68.22', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-02 23:25:44'),
(75, 2, '66.249.68.22', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-03 08:14:43'),
(76, 2, '66.249.68.20', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-03 17:25:57'),
(77, 2, '66.249.75.90', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-05 00:06:24'),
(78, 3, '66.249.75.91', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-07 04:58:42'),
(79, 3, '202.151.41.77', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.117 Safari/537.36', '2020-01-09 05:35:31'),
(80, 2, '202.151.41.77', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.117 Safari/537.36', '2020-01-09 05:36:00'),
(81, 1, '202.151.41.77', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.117 Safari/537.36', '2020-01-09 05:36:32'),
(82, 1, '184.22.225.71', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.117 Safari/537.36', '2020-01-15 15:59:54'),
(83, 3, '182.232.189.98', 'Mozilla/5.0 (Linux; Android 6.0; vivo 1601) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/73.0.3683.90 Mobile Safari/537.36', '2020-02-02 05:31:39');

-- --------------------------------------------------------

--
-- Table structure for table `articles`
--

CREATE TABLE `articles` (
  `id` int(11) NOT NULL,
  `subject` varchar(255) NOT NULL,
  `sub_title` varchar(255) NOT NULL,
  `detail` text NOT NULL,
  `image` varchar(255) NOT NULL,
  `status` enum('true','false') NOT NULL DEFAULT 'true',
  `datetime` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `articles`
--

INSERT INTO `articles` (`id`, `subject`, `sub_title`, `detail`, `image`, `status`, `datetime`) VALUES
(9, 'ทำเกษตรแล้วปรับตัวอย่างไร ในยุค Thailand 4.0', 'ในยุค Thailand 4.0 มีการปรับใช้กับการทำเกษตรอย่างไร', '<p style=\"text-align:center\"><img alt=\"\" class=\"img-fluid\" src=\"https://klongri-ffs.com/klongri/admin/assets/images/source/Untitled-2-696x392.jpg\" style=\"height:100%; width:100%\" /></p>\r\n\r\n<h4>ในยุค Thailand 4.0 มีการปรับใช้กับการทำเกษตรอย่างไร</h4>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; แน่นอนว่าในยุคนี้&nbsp;<strong>เราต้องนำสื่อและเทคโนโลยีในปัจจุบันเข้ามาช่วยในการทำเกษตร</strong>&nbsp;เป็นการทำเกษตรแบบ Smart farmer ปรับเปลี่ยนจากการทำเกษตรในแบบเดิมที่เน้นการปลูกในปริมาณมาก มาเป็นการ<strong>ปลูกให้พอเหมาะกับกำลังของตนเองและพอดีกับความต้องการของผู้บริโภค เป็นการปลูกแบบการตลาดนำการผลิต</strong>&nbsp;ทั้งนี้ก็ป็นการทำเกษตรที่ใช้ประโยชน์จากเทคโนโลยี เพื่อให้เกิดประโยชน์สูงสุดในการทำเกษตร</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4>มีการปรับและพัฒนาสินค้าของเราสู่ตลาดให้เป็นที่นิยมในยุค Thailand 4.0 อย่างไร</h4>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; ปรับเปลี่ยนจากการปลูกพืชเชิงเดี่ยวจำนวนมากเพื่อขายส่งโรงงาน&nbsp;<strong>มาเป็นการทำตลาดของตัวเองโดยผ่านช่องทาง Social media หรือ Website สร้างเรื่องราวจากสิ่งที่ทำ แล้วนำมาเผยแพร่ออกไปสู่ผู้บริโภค ให้เห็นขั้นตอนตั้งแต่การเริ่มผลิต เก็บเกี่ยว แพคบรรจุ มีการวางแผนการผลิตให้เหมาะกับฤดูกาลและตรงกับความต้องการขอลูกค้าในพื้นที่ ออกแบบแพคเกจให้ทันสมัย สร้างแบรนด์ สร้างระบบการค้นหาและจัดส่ง จนกระทั่งส่งสินค้าให้ถึงมือของผู้บริโภคโดยตรง</strong></p>\r\n\r\n<p>ทั้งหมดนี้ก็เป็นการปรับเปลี่ยนจากการทำเกษตรในยุคเก่ามาเป็นเกษตรกรในยุค Thailand 4.0 นั่นเอง</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4>คุณลักษณะอะไรในไร่ที่ทำให้โดดเด่นและได้เปรียบในยุคนี้</h4>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; สิ่งที่จะทำให้ได้เปรียบในยุคนี้ก็คือ ช่องทางการสื่อสารที่ส่งออกไปหาผู้บริโภคได้โดยตรง ต่างจากสมัยที่ต้องอาศัยสื่อจากวิทยุ โทรทัศน์ และหนังสือพิมพ์ ที่มีค่าใช้จ่ายค่อนข้างสูง</p>\r\n\r\n<p>เพราะปัจจุบันเรามีเครื่องมือที่หลากหลาย อาทิเช่น Social media ,Website ,Youtube ฯ ที่สามารถเผยแพร่ประชาสัมพันธ์ผลงานและผลผลิตภายในไร่ออกไปสู่ผู้บริโภค ให้สามารถเชื่อมต่อกันได้โดยไม่ต้องอาศัยพ่อค้าคนกลางเหมือนเช่นในอดีต</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4>การนำปรัญญาเศรษฐกิจพอเพียงมาประยุกต์ใช้กับ Thailand 4.0 ได้อย่างไร</h4>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; ถ้าพูดถึงเรื่องเศรษฐกิจพอเพียง ก็คงต้องเริ่มจากที่ตัวเราให้มีความพอดีก่อน&nbsp;<strong>เริ่มทำจากเล็กไปใหญ่ ค่อย ๆ เรียนรู้ ลงมือทำ ปรับปรุง แก้ไขไปพร้อม ๆ กัน สร้างแบรนด์ สร้างระบบ ก้าวทีละก้าว เป็นก้าวเล็กที่มั่นคงและเดินไปไม่หยุด</strong>&nbsp;เพียงเท่านี้ ทุก ๆ สิ่งที่ทำมันก็จะเป็นก้าวที่พอดีและพอเพียงสำหรับตัวเราแล้วล่ะครับ</p>\r\n', 'klongri_89591880520191105_085811.jpg', 'true', '2019-11-05 01:58:11'),
(10, 'แนวทางเกษตรอินทรีย์', 'แนวคิดพื้นฐานของเกษตรอินทรีย์คือ', '<p style=\"text-align:center\"><img src=\"https://www.greennet.or.th/wp-content/uploads/2019/05/12183887_1006692012705665_6064341247290794815_o.jpg\" style=\"height:100%; width:100%\" /></p>\r\n\r\n<p>การทำการเกษตรแบบองค์รวม ซึ่งแตกต่างอย่างมากจากระบบเกษตรแผนใหม่ที่มุ่งเน้นการใช้ปัจจัยการผลิต ต่างๆ เพื่อเพิ่มผลผลิตเฉพาะพืชที่ปลูก ซึ่งเป็นแนวคิดแบบแยกส่วน เพราะให้ความสนใจเฉพาะแต่ผลผลิตของพืชหลักที่ปลูก โดยไม่ได้คำนึงถึงผลกระทบต่อทรัพยากรการเกษตรหรือนิเวศการเกษตร สำหรับเกษตรอินทรีย์ซึ่งเป็นการเกษตรแบบองค์รวมจะให้ความสำคัญกับการ อนุรักษ์ทรัพยากรธรรมชาติและระบบนิเวศการเกษตร โดยเฉพาะอย่างยิ่งการฟื้นฟูความอุดมสมบูรณ์ของดิน, การรักษาแหล่งน้ำให้สะอาด และการฟื้นฟูความหลากหลายทางชีวภาพของฟาร์ม ทั้งนี้เพราะแนวทางเกษตรอินทรีย์อาศัยกลไกและกระบวนการของระบบนิเวศในการทำ การผลิต</p>\r\n\r\n<p>จากเหตุผลที่ได้กล่าวมาแล้วข้างต้น เกษตรอินทรีย์จึงปฏิเสธการใช้สารเคมีกำจัดศัตรูพืชและปุ๋ยเคมี เนื่องจากสารเคมีการเกษตรเหล่านี้มีผลกระทบต่อกลไกและกระบวนการของระบบนิเวศ นอกเหนือจากการปฏิเสธการใช้สารเคมีการเกษตรแล้ว เกษตรอินทรีย์ยังให้ความสำคัญกับการสร้างสมดุลของวงจรของธาตุอาหาร, การประหยัดพลังงาน, การอนุรักษ์ระบบนิเวศการเกษตร และการฟื้นฟูความหลากหลายทางชีวภาพ ซึ่งถือได้ว่าเกษตรอินทรีย์เป็นการบริหารจัดการฟาร์มเชิงบวก (positive management) และการจัดการเชิงบวกนี้เองที่ทำให้เกษตรอินทรีย์แตกต่างอย่างสำคัญจากการ เกษตรที่ไม่ใช้สารเคมีแบบปล่อยปะละเลย (ที่มักอ้างว่า เป็นการเกษตรตามแบบธรรมชาติ) หรือเกษตรปลอดสารเคมีและเกษตรไร้สารพิษที่เฟื่องฟูในบ้านเรามานานหลายปี</p>\r\n\r\n<p>เนื่องจากเกษตรอินทรีย์เป็นการเกษตรที่ให้ความสำคัญกับการ ทำฟาร์มเชิงสร้างสรรค์ (เพื่ออนุรักษ์และฟื้นฟูระบบนิเวศการเกษตรในไร่นา) ดังนั้นเกษตรกรที่หันมาทำเกษตรอินทรีย์จึงจำเป็นต้องพัฒนาการเรียนรู้เกี่ยว กับธรรมชาติและการบริหารจัดการฟาร์มของตนเพิ่มขึ้นด้วย ผลที่ตามมาก็คือเกษตรอินทรีย์จึงเป็นแนวทางการเกษตรที่ตั้งอยู่บนกระบวนการ แห่งการเรียนรู้และภูมิปัญญา เพราะเกษตรกรต้องสังเกต, ศึกษา, วิเคราะห์-สังเคราะห์ และสรุปบทเรียนเกี่ยวกับการทำการเกษตรของฟาร์มตนเอง ซึ่งจะมีเงื่อนไขทั้งทางกายภาพ (เช่น ลักษณะของดิน ภูมิอากาศ และภูมินิเวศ) รวมถึงเศรษฐกิจ-สังคมที่แตกต่างจากพื้นที่อื่น เพื่อคัดสรรและพัฒนาแนวทางเกษตรอินทรีย์ที่เฉพาะและเหมาะสมกับฟาร์มของ ตัวเองอย่างแท้จริง</p>\r\n\r\n<p>นอกจากนี้ เกษตรอินทรีย์ยังให้ความสำคัญกับเกษตรกรผู้ผลิตและชุมชนท้องถิ่น เกษตรอินทรีย์มุ่งหวังที่จะสร้างความมั่นคงในการทำการเกษตรสำหรับเกษตรกร ตลอดจนอนุรักษ์และฟื้นฟูวิถีชีวิตของชุมชนเกษตรกรรม วิถีการผลิตของเกษตรอินทรีย์เป็นวิถีการผลิตที่เกษตรกรต้องอ่อนน้อมและ เรียนรู้ในการดัดแปลงการผลิตของตนให้เข้ากับวิถีธรรมชาติ อาศัยกลไกธรรมชาติเพื่อทำการเกษตร ดังนั้นวิถีการผลิตเกษตรอินทรีย์จึงเป็นวิถีแห่งการเคารพและพึ่งพิงธรรมชาติ ซึ่งสอดคล้องกลมกลืนกับวิถีชีวิตของชุมชนเกษตรพื้นบ้านของสังคมไทย</p>\r\n\r\n<p>แต่ในขณะเดียวกัน เกษตรอินทรีย์ก็ไม่ได้ปฏิเสธการผลิตเพื่อการค้า เพราะตระหนักว่าครอบครัวเกษตรกรส่วนใหญ่จำเป็นต้องพึ่งพาการจำหน่ายผลผลิต เพื่อเป็นรายได้ในการดำรงชีพ ขบวนการเกษตรอินทรีย์พยายามส่งเสริมการทำการตลาดผลผลิตเกษตรอินทรีย์ทั้งใน ระดับท้องถิ่น ประเทศ และระหว่างประเทศ โดยการตลาดท้องถิ่นอาจมีรูปแบบที่หลากหลายตามแต่เงื่อนไขทางสภาพเศรษฐกิจและ สังคมของท้องถิ่นนั้น เช่น ระบบชุมชนสนับสนุนการเกษตร (Community Support Agriculture &ndash; CSA) หรือระบบอื่นๆ ที่มีหลักการในลักษณะเดียวกัน ส่วนตลาดที่ห่างไกลออกไปจากผู้ผลิต ขบวนการเกษตรอินทรีย์ได้พยายามพัฒนามาตรฐานการผลิตและระบบการตรวจสอบรับรอง ที่สร้างความมั่นใจให้กับผู้บริโภคได้ว่า ทุกขั้นตอนของการผลิต แปรรูป และการจัดการนั้นเป็นการทำงานที่พยายามอนุรักษ์และฟื้นฟูสิ่งแวดล้อม ตลอดจนรักษาคุณภาพของผลผลิตให้เป็นธรรมชาติเดิมมากที่สุด</p>\r\n\r\n<p>จากแนวคิดหลักพื้นฐานของเกษตรอินทรีย์ ที่มุ่งเน้นการทำการเกษตรที่อนุรักษ์และฟื้นฟูสิ่งแวดล้อม แนวทางปฏิบัติของเกษตรอินทรีย์จึงเน้นการผลิตความสอดคล้องกับวิถีธรรมชาติ โดยการประยุกต์ปรับใช้กลไกนิเวศธรรมชาติสำหรับการทำเกษตร ที่สำคัญได้แก่ การหมุนเวียนธาตุอาหาร, การสร้างความอุดมสมบูรณ์ของดิน, ความสัมพันธ์แบบสมดุลของสิ่งมีชีวิตที่หลากหลาย, การอนุรักษ์และฟื้นฟูนิเวศการเกษตร,</p>\r\n\r\n<h3>การหมุนเวียนธาตุอาหาร</h3>\r\n\r\n<p>ในป่าธรรมชาติ ต้นไม้พืชพรรณได้รับธาตุอาหารจากดินและอากาศ โดยธาตุอาหารในดินจะถูกดูดซึมผ่านทางราก ส่วนธาตุอาหารในอากาศพืชจะได้รับจากการหายใจทางใบ เมื่อพืชได้รับแสงก็จะสังเคราะห์ธาตุอาหารเหล่านี้มาเป็นสารอาหารต่างๆ ซึ่งทำให้พืชเจริญเติบโต และเพิ่มชีวมวล (biomass) ของพืชเอง ไม่ว่าจะเป็นลำต้นที่ขยายใหญ่ขึ้น กิ่งก้านและใบเพิ่มขึ้น ฯลฯ เมื่อใบหรือกิ่งแก่ลงก็จะร่วงหล่นลงดิน หรือบางส่วนของพืชอาจถูกสัตว์หรือแมลงกัดแทะ และเมื่อสัตว์ถ่ายมูลออกมา มูลเหล่านั้นก็กลับคืนลงสู่ดิน ทั้งชีวมวลจากพืชและมูลสัตว์ที่กินพืช (ที่เราเรียก &ldquo;อินทรีย์วัตถุ&rdquo;) เมื่อกลับคืนสู่ดินก็จะถูกย่อยสลายโดยจุลินทรีย์และปลดปล่อยธาตุอาหารออกมา ซึ่งรากพืชจะดูดซึมกลับไปเป็นธาตุอาหารอีกครั้งหนึ่ง วัฏจักรหรือวงจรธาตุอาหารที่หมุนเวียนไปอย่างสมดุลนี้เอง ที่ทำให้พืชในป่าสามารถเจริญเติบโตได้อย่างยั่งยืนเป็นเวลาหลายร้อยหลายพัน ปี เพราะธาตุอาหารทั้งหมดหมุนเวียนอยู่ในระบบนิเวศนั้นๆ อย่างต่อเนื่อง</p>\r\n\r\n<p>แน่นอนว่าการทำเกษตรไม่ว่าจะเพื่อยังชีพ หรือเพื่อจำหน่ายก็ตาม ธาตุอาหารส่วนหนึ่งย่อมสูญหายไปจากระบบนิเวศการเกษตรจากการบริโภคผลผลิต ดังนั้นเกษตรกรจำเป็นต้องหาวิธีการที่เหมาะสมในการหาธาตุอาหารจากภายนอก ฟาร์มมาชดเชยส่วนที่สูญเสียไป แต่ปัญหาการสูญเสียธาตุอาหารในฟาร์มที่สำคัญกว่าก็คือ การสูญเสียธาตุอาหารในดินที่เกิดขึ้นจากการชะล้างหน้าดิน, การกัดเซาะของลม ฝน และน้ำ, ธาตุอาหารที่ไหลลงดินลึกชั้นล่าง รวมถึงที่สูญเสียไปทางอากาศ ดังนั้นเกษตรอินทรีย์จึงให้ความสำคัญกับการป้องกันการสูญเสียธาตุอาหารที่ เกิดจากระบบการผลิต โดยมีเป้าหมายเพื่อลดการพึ่งพาแหล่งธาตุอาหารจากภายนอกฟาร์มที่มากเกินไป</p>\r\n\r\n<p>แนวทางการหมุนเวียนธาตุอาหารในฟาร์มอาศัยหลักการทางธรรมชาติ ด้วยการใช้ธาตุอาหารพืชที่อยู่ในรูปของอินทรีย์วัตถุที่สามารถย่อยสลายได้ โดยจุลินทรีย์ ซึ่งจะทำให้วงจรธาตุอาหารหมุนเวียนได้อย่างต่อเนื่อง ตัวอย่างของการหมุนเวียนธาตุอาหารในแนวทางเกษตรอินทรีย์ที่สำคัญ คือ การใช้ปุ๋ยหมัก, การคลุมดินด้วยอินทรีย์วัตถุ, การปลูกพืชเป็นปุ๋ยพืชสด และการปลูกพืชหมุนเวียน เป็นต้น</p>\r\n\r\n<h3>ความอุดมสมบูรณ์ของธาตุอาหารในดิน</h3>\r\n\r\n<p>&ldquo;ความอุดมสมบูรณ์ของดิน&rdquo; ถือได้ว่าเป็นหัวใจของเกษตรอินทรีย์ ผิวดินในระบบนิเวศป่าธรรมชาติจะมีเศษซากพืชและใบไม้ปกคลุมอยู่ตลอดเวลา ซึ่งอินทรีย์วัตถุที่คลุมดินนี้ นอกจากจะช่วยป้องกันการกัดเซาะและการพังทลายของหน้าดินแล้ว ยังมีส่วนสำคัญที่ทำให้ดินมีความอุดมสมบูรณ์มากขึ้น เพราะอินทรีย์วัตถุเหล่านี้เป็นอาหารของสิ่งมีชีวิตและจุลินทรีย์ที่อยู่ใน ดิน ดังนั้นการมีอินทรีย์วัตถุคลุมหน้าดินจึงทำให้ &ldquo;ดินมีชีวิต&rdquo; ขึ้น ซึ่งเมื่ออินทรีย์วัตถุเหล่านี้ย่อยสลายผุพัง (โดยการทำงานของสิ่งมีชีวิตและจุลินทรีย์ในดิน) ก็จะทำให้เกิดฮิวมัสซึ่งทำให้ดินร่วนซุย และสามารถเก็บกักน้ำและธาตุอาหารต่างๆ ได้เพิ่มมากขึ้น ดินจึงมีความชื้นอยู่ตลอดเวลาและมีธาตุอาหารเพียงพอให้กับพืชพรรณในบริเวณ ดังกล่าวเจริญเติบโตได้อย่างสมบูรณ์แข็งแรง</p>\r\n\r\n<p>ดังนั้น หลักการของการทำเกษตรอินทรีย์จึงจำเป็นต้องหาอินทรีย์วัตถุต่างๆ มาคลุมหน้าดินอยู่เสมอ ไม่ว่าจะเป็นฟาง ใบไม้ หรือแม้แต่พืชขนาดเล็ก (เช่น พืชที่ใช้ปลูกคลุมดิน) ซึ่งอินทรีย์วัตถุเหล่านี้จะกลายเป็นอาหารของสิ่งมีชีวิตและจุลินทรีย์ในดิน ทำให้ดินฟื้นกลับมามีชีวิตอีกครั้งหนึ่ง นอกจากนี้การไม่ใช้สารเคมีต่างๆ ที่เป็นอันตรายต่อสิ่งมีชีวิตและจุลินทรีย์ในดิน (เช่น สารเคมีกำจัดศัตรูพืช) เป็นการช่วยทำให้ดินสามารถฟื้นความสมบูรณ์ของตัวเองได้อย่างรวดเร็ว เมื่อดินมีความสมบูรณ์พืชที่ปลูกก็แข็งแรง มีความต้านทานต่อโรคและแมลง รวมทั้งให้ผลผลิตสูง</p>\r\n\r\n<h3>ความหลากหลายที่สัมพันธ์กันอย่างสมดุลในระบบนิเวศ</h3>\r\n\r\n<p>นิเวศป่าธรรมชาติมีพืชพรรณและสิ่งมีชีวิตต่างๆ อยู่ร่วมกันอย่างหลากหลาย สิ่งมีชีวิตต่างๆ เหล่านี้มีทั้งที่พึ่งพาอาศัยกัน แข่งขันกัน หรือเป็นอาหารของสิ่งมีชีวิตอีกชนิดหนึ่ง แต่ต่างก็สามารถดำรงอยู่ร่วมกันได้อย่างสมดุลและมีเสถียรภาพ พืชพรรณต่างๆ แม้จะมีแมลงหรือศัตรูที่กินพืชนั้นเป็นอาหารบ้าง แต่ก็ไม่ได้ทำลายพืชนั้นจนเสียหายไปทั้งหมด ทั้งนี้เพราะพืชเองก็มีความสามารถที่จะฟื้นฟูตัวเองจากการทำลายของศัตรูพืช ได้ และนอกจากนี้เมื่อมีแมลงศัตรูพืชเกิดขึ้นมาก ก็จะมีสิ่งมีชีวิตอื่นที่เป็นศัตรูตามธรรมชาติมาควบคุมประชากรของศัตรูพืช ให้ลดลงอยู่ในภาวะที่สมดุล</p>\r\n\r\n<p>จากหลักการนี้เอง การทำเกษตรอินทรีย์จะต้องหาสมดุลของการเพาะปลูกพืชที่หลากหลาย ไม่ว่าจะเป็นการปลูกพืชร่วมหลายชนิดในเวลาเดียวกัน หรือเหลื่อมเวลากัน ตลอดจนการปลูกพืชหมุนเวียนต่างชนิดกัน รวมทั้งการเลี้ยงสัตว์ ทั้งนี้การทำเกษตรที่หลากหลาย (ซึ่งมักนิยมเรียกกันว่า &ldquo;เกษตรผสมผสาน&rdquo;) นับเป็นการใช้ประโยชน์จากทรัพยากรอย่างมีประสิทธิภาพมากกว่า และยังเป็นการลดความเสี่ยงภัยจากปัญหาโรคและแมลงศัตรูพืชระบาดอีกด้วย นอกจากนี้การไม่ใช้สารเคมีกำจัดศัตรูพืชจะมีส่วนช่วยให้ศัตรูธรรมชาติสามารถ แสดงบทบาทในการควบคุมศัตรูพืช ซึ่งเป็นการสร้างสมดุลนิเวศการเกษตรอีกวิธีหนึ่ง เพราะการใช้สารเคมีกำจัดศัตรูพืชจะทำลายศัตรูธรรมชาติในสัดส่วนที่มากกว่า ศัตรูพืช ทำให้ศัตรูพืชกลับยิ่งระบาดรุนแรงมากขึ้นอีก</p>\r\n\r\n<h3>การอนุรักษ์และฟื้นฟูนิเวศการเกษตร</h3>\r\n\r\n<p>แนวทางสำคัญของเกษตรอินทรีย์ก็คือ การอนุรักษ์ระบบนิเวศการเกษตรและสิ่งแวดล้อม ด้วยการปฏิเสธการใช้สารเคมีสังเคราะห์ทุกชนิด ทั้งนี้เพราะปัจจัยการผลิตที่เป็นสารเคมีสังเคราะห์ทำลายสมดุลของนิเวศการ เกษตรและส่งผลกระทบด้านลบต่อสิ่งแวดล้อม การใช้สารเคมีกำจัดศัตรูพืช (ไม่ว่าจะเป็นสารเคมีฆ่าแมลง สารเคมีป้องกันกำจัดเชื้อรา และสารเคมีกำจัดวัชพืช) มีผลต่อสิ่งมีชีวิตต่างๆ ที่อยู่ในฟาร์มทั้งที่อยู่บนผิวดินและใต้ดิน เช่น สัตว์ แมลง และจุลินทรีย์ ในกลไกธรรมชาติสิ่งมีชีวิตต่างๆ เหล่านี้มีบทบาทสำคัญในการสร้างสมดุลของนิเวศการเกษตร ไม่ว่าจะเป็นการช่วยควบคุมประชากรของสิ่งมีชีวิตอื่น โดยเฉพาะอย่างยิ่งศัตรูพืช หรือการพึ่งพาอาศัยกันในการดำรงชีวิต เช่น การผสมเกสร และการช่วยย่อยสลายอินทรีย์วัตถุ ซึ่งสิ่งมีชีวิตเหล่านี้ส่วนใหญ่มีทั้งที่เป็นประโยชน์ต่อพืชที่เกษตรกร เพาะปลูก หรืออย่างน้อยก็ไม่ได้สร้างผลเสียกับพืชที่ปลูกแต่อย่างใด แต่การใช้สารเคมีกำจัดศัตรูพืชนั้นมีผลทำลายสิ่งมีชีวิตทั้งหมด โดยเฉพาะอย่างยิ่งสิ่งมีชีวิตที่เป็นประโยชน์ ในขณะที่โรคและแมลงศัตรูพืชมักจะมีความสามารถพิเศษในการพัฒนาภูมิต้านทานต่อ สารเคมี ดังนั้นเมื่อมีการใช้สารเคมีกำจัดศัตรูพืช แมลงที่เป็นประโยชน์จึงถูกทำลายได้โดยง่าย ในขณะที่แมลงศัตรูพืชสามารถอยู่รอดได้โดยไม่เป็นอันตราย แม้แต่ปุ๋ยเคมีก็มีผลเสียต่อจุลินทรีย์และสิ่งมีชีวิตในดิน ทำให้สมดุลของนิเวศดินเสีย ดังนั้นเกษตรอินทรีย์จึงห้ามไม่ให้ใช้ปัจจัยการผลิตที่เป็นสารเคมี สังเคราะห์ทุกชนิดในการเพาะปลูก</p>\r\n\r\n<p>นอกเหนือจากการอนุรักษ์แล้ว แนวทางเกษตรอินทรีย์ยังเน้นให้เกษตรกรต้องฟื้นฟูสมดุลและความอุดมสมบูรณ์ของ ระบบนิเวศด้วย ซึ่งหลักการนี้ทำให้เกษตรอินทรีย์มีความแตกต่างอย่างมากจากระบบเกษตรปลอดสาร เคมีที่รู้จักกันในประเทศไทย แนวทางหลักในการฟื้นฟูนิเวศการเกษตรก็คือ การปรับปรุงบำรุงดินด้วยอินทรีย์วัตถุ และการเพิ่มความหลากหลายทางชีวภาพ</p>\r\n\r\n<p>สำหรับระบบเกษตรอินทรีย์ ดินถือว่าเป็นกุญแจสำคัญ เพราะการปรับปรุงบำรุงดินทำให้ต้นไม้ได้รับธาตุอาหารอย่างครบถ้วนและสมดุล ซึ่งจะช่วยให้ต้นไม้แข็งแรง มีความต้านทานต่อการระบาดของโรคและแมลง อันจะทำให้เกษตรกรไม่จำเป็นต้องพึ่งพาการใช้สารเคมีกำจัดศัตรูพืช ทั้งยังสามารถเพิ่มผลผลิตได้อย่างยั่งยืนกว่าการเพาะปลูกด้วยระบบเกษตรเคมี อีกด้วย นอกจากนี้ผลผลิตของเกษตรอินทรีย์ยังมีรสชาติดี และมีคุณค่าทางโภชนาการที่ครบถ้วน</p>\r\n\r\n<p>นอกเหนือจากการปรับปรุงบำรุงดินแล้ว การเพิ่มความหลากหลายทางชีวภาพในไร่นาก็เป็นสิ่งจำเป็น นับเป็นเรื่องสำคัญต่อความยั่งยืนของระบบนิเวศการเกษตร เพราะการที่สิ่งมีชีวิตหลากหลายชนิดอยู่ร่วมกันย่อมก่อให้เกิดความเกื้อกูล และสมดุลของระบบนิเวศ ซึ่งจะช่วยเสริมสร้างกระบวนการและพลวัตทางธรรมชาติที่เกื้อหนุนต่อการทำ เกษตรอินทรีย์อีกต่อหนึ่ง วิธีการเพิ่มความหลากหลายทางชีวภาพอาจทำได้หลายรูปแบบ เช่น การปลูกพืชร่วม, พืชแซม, พืชหมุนเวียน, ไม้ยืนต้น หรือการฟื้นฟูแหล่งนิเวศธรรมชาติในไร่นาหรือบริเวณใกล้เคียง</p>\r\n\r\n<h3>การพึ่งพากลไกธรรมชาติในการทำเกษตร</h3>\r\n\r\n<p>เกษตรอินทรีย์ตั้งอยู่บนปรัชญาแนวคิดที่ว่า การเกษตรที่ยั่งยืนต้องเป็นการเกษตรที่เป็นไปตามครรลองของธรรมชาติ ไม่ใช่การเกษตรที่ฝืนวิถีธรรมชาติ ดังนั้น การทำเกษตรจึงไม่ใช่การพยายามเอาชนะธรรมชาติ หรือการพยายามดัดแปลงธรรมชาติเพื่อการเพาะปลูก แต่เป็นการเรียนรู้จากธรรมชาติและปรับระบบการทำเกษตรให้เข้ากับวิถีแห่ง ธรรมชาติ</p>\r\n\r\n<p>กลไกในธรรมชาติที่สำคัญต่อการทำเกษตรอินทรีย์ได้แก่ วงจรการหมุนเวียนธาตุอาหาร โดยเฉพาะอย่างยิ่งวงจรไนโตรเจนและคาร์บอน วงจรการหมุนเวียนของน้ำ, พลวัตของภูมิอากาศและแสงอาทิตย์ รวมทั้งการพึ่งพากันของสิ่งมีชีวิตอย่างสมดุลในระบบนิเวศ ทั้งในเชิงของการเกื้อกูล การพึ่งพา และห่วงโซ่อาหาร</p>\r\n\r\n<p>ตามที่ต่างๆ ทั่วโลกย่อมมีระบบนิเวศและกลไกตามธรรมชาติที่แตกต่างกันออกไป เกษตรกรที่ทำเกษตรอินทรีย์จึงจำเป็นที่จะต้องเรียนรู้ถึงสภาพเงื่อนไขของ ท้องถิ่นที่ตนเองทำการเกษตรอยู่ การหมั่นสังเกต เรียนรู้ วิเคราะห์-สังเคราะห์ และทำการทดลอง เป็นกระบวนการเรียนรู้ที่ต้องดำเนินการไปอย่างต่อเนื่อง เพื่อที่ว่าระบบฟาร์มเกษตรอินทรีย์ของเกษตรกรแต่ละรายจะได้ใช้ประโยชน์จาก กลไกธรรมชาติและสภาพนิเวศท้องถิ่นอย่างเต็มที่</p>\r\n\r\n<h3>การพึ่งพาตนเองด้านปัจจัยการผลิต</h3>\r\n\r\n<p>เกษตรอินทรีย์มีแนวทางที่มุ่งให้เกษตรกรพยายามผลิตปัจจัย การผลิตต่างๆ เช่น ปุ๋ยอินทรีย์ เมล็ดพันธุ์ ฯลฯ ด้วยตนเองในฟาร์มให้ได้มากที่สุด แต่ในกรณีที่เกษตรกรไม่สามารถผลิตได้เอง (เช่น มีพื้นที่การผลิตไม่พอเพียง หรือต้องมีการลงทุนสูงสำหรับการผลิตปัจจัยการผลิตที่จำเป็นต้องใช้) เกษตรกรก็สามารถซื้อหาปัจจัยการผลิตจากภายนอกฟาร์มได้ แต่ควรเป็นปัจจัยการผลิตที่มีอยู่แล้วในท้องถิ่น</p>\r\n\r\n<p>แนวทางนี้เป็นไปตามหลักการสร้างสมดุลของวงจรธาตุอาหารที่ กระตุ้นให้เกษตรกรพยายามจัดสมดุลของวงจรธาตุอาหารในระบบที่เล็กที่สุด (ซึ่งก็คือในฟาร์มของเกษตรกร) และมีความสอดคล้องกับนิเวศของท้องถิ่น อันจะช่วยสร้างเสถียรภาพและความยั่งยืนของระบบการผลิตในระยะยาว นอกจากนี้การเลือกใช้ปัจจัยการผลิตที่มีอยู่ในท้องถิ่นยังเป็นการใช้ ทรัพยากรอย่างมีประสิทธิภาพ และลดปัญหาผลกระทบที่เกิดขึ้นจากการขนย้ายปัจจัยการผลิตเป็นระยะทางไกลๆ</p>\r\n\r\n<p>การพึ่งพาตนเองด้านปัจจัยการผลิตยังมีนัยทางเศรษฐกิจและสังคมที่สำคัญ กล่าวคือ เกษตรอินทรีย์ไม่ใช่เพียงแค่เทคนิคการผลิต แต่เป็นวิถีชีวิตและขบวนการทางสังคม จากประสบการณ์ของการพัฒนาระบบเกษตรเคมีที่ผ่านมา เกษตรกรสูญเสียการเข้าถึงและการควบคุมปัจจัยการผลิตและกระบวนการผลิตในเกือบ ทุกขั้นตอน จำเป็นต้องพึ่งพิงองค์กรภาครัฐและธุรกิจเอกชนในการจัดหาปัจจัยการผลิตและ เทคโนโลยีการผลิตเกือบทุกด้าน จนเกษตรกรเองแทบไม่ต่างไปจากแรงงานรับจ้างในฟาร์มที่ทำงานในที่ดินของตนเอง การส่งเสริมการพึ่งพาตนเองของเกษตรกรในระบบเกษตรอินทรีย์จึงเป็นส่วนหนึ่ง ของการสร้างความเข้มแข็งและความเป็นอิสระของเกษตรกรและองค์กรเกษตรกร ซึ่งจะมีส่วนสำคัญในการพัฒนาประชาธิปไตยระดับรากหญ้าอีกด้วย</p>\r\n', 'klongri_39232924820191105_222134.jpg', 'true', '2019-11-05 15:10:50'),
(11, 'บทความพิเศษ/เกษตรอินทรีย์ (Organic Agriculture)', 'ทางเลือก ทางรอดของเกษตรกรไทย', '<p><a href=\"https://siamrath.co.th/files/styles/1140/public/img/20170330/316ae2ad295750b6a5fcb6e4e99b3d146ba344ad3d434f45563f556cd7cb6a87.jpg?itok=4pVIF62c\"><img alt=\"\" src=\"https://siamrath.co.th/files/styles/1140/public/img/20170330/316ae2ad295750b6a5fcb6e4e99b3d146ba344ad3d434f45563f556cd7cb6a87.jpg?itok=4pVIF62c\" style=\"height:100%; width:100%\" /></a></p>\r\n\r\n<p><strong>ประเทศไทย เป็นประเทศที่ภาคเกษตรกรรมมีความสำคัญมาก เนื่องจากภูมิประเทศมีความอุดมสมบูรณ์ เอื้อต่อการทำการเกษตรกรรม และประชากรส่วนใหญ่ของประเทศก็ประกอบอาชีพเกษตรกรรมเป็นอาชีพหลัก แต่กว่าครึ่งศตวรรษที่ผ่านมาทรัพยากรธรรมชาติที่มีอยู่ได้ลดลงอย่างรวดเร็ว เนื่องจากเป็นยุคของการทำเกษตรแบบอุตสาหกรรม ทำให้เกษตรกรส่วนใหญ่ ทิ้งวิถีชีวิตการทำเกษตรแบบดั้งเดิมที่อนุรักษ์ระบบนิเวศและสภาพแวดล้อมทางธรรมชาติ หันมาทำการเกษตรที่ต้องพึ่งพาสารเคมี ทั้งปุ๋ยเคมีและสารกำจัดศัตรูพืชเป็นปัจจัยสำคัญในการผลิต สารเคมีเหล่านี้เป็นตัวการสำคัญในการทำลายหน้าดินทำให้ดินเสื่อมสภาพ คุณภาพดินลดลงเรื่อยๆ หากต้องการปริมาณผลผลิตเท่าเดิม ต้องใช่สารเคมีในปริมาณที่มากขึ้น ส่งผลให้ดินเสียหายหนักขึ้นและเร็วขึ้น</strong></p>\r\n\r\n<p><a href=\"https://siamrath.co.th/files/styles/750/public/img/20170330/92e861de1ea51a950218f4982973e626e82f0c7a6ebc139b2f1873b9f94488c4.jpg?itok=CuHyuQ7I\"><img alt=\"\" src=\"https://siamrath.co.th/files/styles/750/public/img/20170330/92e861de1ea51a950218f4982973e626e82f0c7a6ebc139b2f1873b9f94488c4.jpg?itok=CuHyuQ7I\" style=\"height:100%; width:100%\" /></a></p>\r\n\r\n<p><a href=\"https://siamrath.co.th/files/styles/750/public/img/20170330/a85cdc7cc33aca7001e50e097948d30f8751ce5a1035f8439b9ed4f52f9a926d.jpg?itok=iHugWzHG\"><img alt=\"\" src=\"https://siamrath.co.th/files/styles/750/public/img/20170330/a85cdc7cc33aca7001e50e097948d30f8751ce5a1035f8439b9ed4f52f9a926d.jpg?itok=iHugWzHG\" style=\"height:100%; width:100%\" /></a></p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>โดยประเทศไทยมีมูลค่าการใช้สารเคมีเพื่อการเกษตร ในแต่ละปีเป็นจำนวนเงินที่สูงนับหมื่นล้านบาท และสารเคมีที่ใช้ต้องนำเข้าจากต่างประเทศเป็นส่วนใหญ่ ดังนั้นแม้จะสามารถผลิตสินค้าเกษตรได้เป็นจำนวนมาก แต่รายได้สุทธิของเกษตรกรกลับลดลง เนื่องจากปัจจัยการผลิตเหล่านี้เป็นต้นทุนหลักที่หลีกเลี่ยงไม่ได้ของเกษตรกร ประกอบกับราคาสินค้าภาคเกษตรในตลาดโลกตกต่ำเนื่องภาวะเศรษฐกิจที่ย่ำแย่ส่งผลกระทบไปทั่วโลก ทำให้เกษตรกรตกอยู่ในสภาพที่มีหนี้สินล้นพ้นตัวจนยากจะหลุดพ้นวังวนของความยากจน</p>\r\n\r\n<p>ในยุคปัจจุบันที่กระแสความตื่นตัว ด้านสุขภาพและสิ่งแวดล้อมของผู้บริโภค เกี่ยวกับการรักษาสุขภาพการบริโภคอาหารที่ปลอดภัยและมีประโยชน์ ผลิตภัณฑ์เกษตรอินทรีย์จึงได้รับความสนใจ และการตอบรับจากผู้บริโภคมากขึ้น มีแนวโน้มจะเพิ่มขึ้นเรื่อยๆ ทั้งในประเทศและต่างประเทศ ในการทำเกษตรอินทรีย์นั้น เกษตรกรผู้ผลิต หรือผู้ประกอบการจะต้องปฏิบัติให้เป็นไปตามมาตรฐานเกษตรอินทรีย์ที่หน่วยงานรับรองใช้เป็นเกณฑ์ในการตรวจรับรองผลผลิต โดยในการกำหนดมาตรฐานผู้เกี่ยวข้องส่วนใหญ่จะมาจาก เกษตรกรผู้ผลิต ผู้ประกอบการ ผู้บริโภค นักสิ่งแวดล้อมและนักวิชาการในด้านต่างๆ</p>\r\n\r\n<p><a href=\"https://siamrath.co.th/files/styles/750/public/img/20170330/967cba10b43576ad709605b3342c37ca289c156a6829c82766f201bafd6c0a22.jpg?itok=nlQKWvb-\"><img alt=\"\" src=\"https://siamrath.co.th/files/styles/750/public/img/20170330/967cba10b43576ad709605b3342c37ca289c156a6829c82766f201bafd6c0a22.jpg?itok=nlQKWvb-\" style=\"height:100%; width:100%\" /></a></p>\r\n\r\n<p>รวมทั้ง การทำเกษตรอินทรีย์จะต้องเอื้อต่อการอนุรักษ์ และฟื้นฟูสิ่งแวดล้อม ดิน น้ำ อย่างจริงจัง การปรับเปลี่ยนเข้าสู่ระบบเกษตรอินทรีย์นั้น ในแต่ละมาตรฐานอาจกำหนดระยะเวลาแตกต่างกันออกไป ช่วงระยะปรับเปลี่ยนนี้อาจใช้เวลาตั้งแต่ 12 - 36 เดือน ขึ้นอยู่กับแต่ละมาตรฐาน ในการทำเกษตรแบบอินทรีย์ นอกจากเป็นมิตรกับสิ่งแวดล้อมแล้ว ยังสร้างสมดุลของทรัพยากรในระบบนิเวศ สร้างความหลากหลายของชนิดทรัพยากรไม่ก่อให้เกิดการปนเปื้อนของสารเคมีในดิน น้ำ และพืช ในด้านสุขภาพก็ทำให้สุขภาพแข็งแรง ลดความเสี่ยงของสารเคมีที่อาจปนเปื้อนมากับพืชและสัตว์ และที่สำคัญเกษตรอินทรีย์ ช่วยส่งเสริมให้เกษตรกรมีรายได้ที่สูงขึ้นเนื่องจากผลผลิตจากเกษตรอินทรีย์เป็นที่ต้องการของผู้บริโภคเป็นจำนวนมาก แม้จะมีราคาที่สูงกว่าผลิตภัณฑ์ทางการเกษตรทั่วไปก็ตามและในปัจจุบันหน่วยงานภาครัฐยังได้ร่วมกันผลักดันด้านการส่งเสริมเกษตรอินทรีย์อย่างเป็นรูปธรรมมากขึ้น</p>\r\n\r\n<p><a href=\"https://siamrath.co.th/files/styles/750/public/img/20170330/47850e5cead3a77ce8085db6c6c79a03c9941ff7f0e9702bb78ad8957735a847.jpg?itok=7w5ey7KX\"><img alt=\"\" src=\"https://siamrath.co.th/files/styles/750/public/img/20170330/47850e5cead3a77ce8085db6c6c79a03c9941ff7f0e9702bb78ad8957735a847.jpg?itok=7w5ey7KX\" style=\"height:100%; width:100%\" /></a></p>\r\n\r\n<p>เช่น การจัดตั้งสหกรณ์เกษตรอินทรีย์ ของกรมส่งเสริมสหกรณ์ ที่มุ่งเน้นการส่งเสริมและพัฒนาการทำการเกษตรแบบอินทรีย์ทั้งระบบ โดยมีการส่งเสริมทั้งในด้านการให้ความรู้เกี่ยวกับการทำเกษตรอินทรีย์ ทั้งจากนักวิชาการในด้านต่างๆและจากปราชญ์ชาวบ้าน ในพื้นที่ ตลอดจนการจัดหาแหล่งเงินทุนให้กับเกษตรกร หรือการใช้ตรารับรองมาตรฐานเกษตรอินทรีย์ มกท.(Organic Agriculture Certification Thailand - ACT ) ของกรมวิชาการเกษตร ซึ่งทำให้ผู้บริโภคมีความมั่นใจ และสามารถแยกแยะความแตกต่างของผลิตภัณฑ์ของเกษตรอินทรีย์ กับผลิตภัณฑ์ประเภทอื่นได้สะดวกมากขึ้น</p>\r\n\r\n<p><a href=\"https://siamrath.co.th/files/styles/750/public/img/20170330/6dc4e526ba5a6f0a6ef146be6c63dff56c328028c1afedc6f2d1c4e4836b471c.jpg?itok=pr0v5kDh\"><img alt=\"\" src=\"https://siamrath.co.th/files/styles/750/public/img/20170330/6dc4e526ba5a6f0a6ef146be6c63dff56c328028c1afedc6f2d1c4e4836b471c.jpg?itok=pr0v5kDh\" style=\"height:100%; width:100%\" /></a></p>\r\n\r\n<p>นอกจากนี้ ยังมีผู้ประกอบการภาคเอกชนที่มีนโยบาย การตลาดเกี่ยวกับเกษตรอินทรีย์โดยเฉพาะ เช่น ร้านเลมอนฟาร์ม และผู้ประกอบธุรกิจค้าปลีกขนาดใหญ่ที่เล็งเห็นแนวโน้มและทิศทางการตลาดเกษตรอินทรีย์ จึงเริ่มวางจำหน่ายสินค้าเกษตรอินทรีย์เพิ่มขึ้น อาทิ Top Supermarket , Food Land ทิศทางของตลาดสินค้าจากเกษตรอินทรีย์ทั้งในประเทศและต่างประเทศ ยังมีการขยายตัวอย่างต่อเนื่อง ในช่วงระยะเวลาหลายปีที่ผ่านมาการส่งออกผลิตภัณฑ์เกษตรอินทรีย์ของไทย มีมูลค่าหลายพันล้านบาท โดยตลาดในภูมิภาคยุโรปเป็นตลาดส่งออกที่สำคัญเป็นอันดับแรก รองลงมาคืออเมริกาเหนือ และภูมิภาคเอเชียตะวันออกตามลำดับ<br />\r\nสุเพียงเพ็ญ ศิริสุวรรณ</p>\r\n', 'klongri_41056623120191105_221453.jpg', 'true', '2019-11-05 15:14:53');

-- --------------------------------------------------------

--
-- Table structure for table `articles_ip`
--

CREATE TABLE `articles_ip` (
  `id` int(11) NOT NULL,
  `ref_id_articles` int(11) NOT NULL,
  `REMOTE_ADDR` varchar(255) COLLATE utf8_bin NOT NULL,
  `HTTP_USER_AGENT` text COLLATE utf8_bin NOT NULL,
  `DATETIME` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Dumping data for table `articles_ip`
--

INSERT INTO `articles_ip` (`id`, `ref_id_articles`, `REMOTE_ADDR`, `HTTP_USER_AGENT`, `DATETIME`) VALUES
(1, 4, '171.6.147.31', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-15 11:26:13'),
(2, 3, '171.6.147.31', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-15 11:26:19'),
(3, 2, '171.6.147.31', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-15 11:26:22'),
(4, 1, '171.6.147.31', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-15 11:26:25'),
(5, 4, '171.6.147.31', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-15 14:00:22'),
(6, 4, '171.6.147.31', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-15 14:12:18'),
(7, 4, '182.232.183.159', 'Mozilla/5.0 (Linux; Android 8.1.0; DUB-LX2) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/75.0.3770.101 Mobile Safari/537.36', '2019-09-16 02:40:57'),
(8, 2, '182.232.183.159', 'Mozilla/5.0 (Linux; Android 8.1.0; DUB-LX2) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/75.0.3770.101 Mobile Safari/537.36', '2019-09-16 02:48:17'),
(9, 4, '171.6.147.31', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-16 14:19:56'),
(10, 1, '66.249.65.191', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-17 03:02:06'),
(11, 1, '66.249.65.160', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-17 12:46:43'),
(12, 2, '202.151.41.77', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-18 11:46:03'),
(13, 3, '66.249.65.191', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-19 08:48:01'),
(14, 4, '66.249.65.198', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-19 09:56:32'),
(15, 2, '66.249.65.163', 'Mozilla/5.0 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-21 17:14:25'),
(16, 4, '171.7.73.159', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-21 17:31:33'),
(17, 5, '171.7.73.159', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-22 13:42:08'),
(18, 6, '171.7.73.159', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-22 14:24:10'),
(19, 7, '171.7.73.159', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-22 14:33:25'),
(20, 6, '171.7.73.159', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-22 14:34:39'),
(21, 3, '66.249.71.155', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-23 09:58:29'),
(22, 1, '66.249.71.64', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-23 10:47:26'),
(23, 4, '66.249.71.95', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-23 11:40:28'),
(24, 1, '66.249.71.155', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-23 11:58:49'),
(25, 4, '66.249.71.154', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-23 12:17:15'),
(26, 3, '66.249.71.95', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-23 13:16:27'),
(27, 7, '171.6.164.177', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36', '2019-09-23 13:22:12'),
(28, 2, '66.249.71.155', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-23 13:56:41'),
(29, 2, '66.249.71.64', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-24 01:09:49'),
(30, 7, '66.249.75.6', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-25 10:28:31'),
(31, 1, '66.249.75.6', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-25 21:49:34'),
(32, 4, '66.249.69.140', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-26 00:24:11'),
(33, 3, '66.249.75.8', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-26 11:34:19'),
(34, 2, '66.249.69.142', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-26 11:44:09'),
(35, 1, '66.249.75.10', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-28 01:23:56'),
(36, 4, '66.249.69.138', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-28 05:25:50'),
(37, 3, '66.249.75.6', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-28 07:27:00'),
(38, 2, '66.249.69.142', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-09-28 14:17:09'),
(39, 7, '171.6.131.38', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.90 Safari/537.36', '2019-09-28 14:50:22'),
(40, 7, '202.151.41.253', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.90 Safari/537.36', '2019-10-02 07:12:22'),
(41, 4, '66.249.65.191', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-10-03 12:26:43'),
(42, 1, '66.249.65.200', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-10-04 03:34:20'),
(43, 1, '66.249.65.163', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-10-04 05:27:21'),
(44, 4, '66.249.65.198', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-10-04 05:27:28'),
(45, 2, '66.249.65.196', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-10-04 05:27:50'),
(46, 3, '66.249.65.196', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-10-04 09:55:22'),
(47, 3, '66.249.65.160', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-10-05 01:33:58'),
(48, 6, '202.151.41.253', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.90 Safari/537.36', '2019-10-07 04:08:12'),
(49, 7, '171.7.103.186', 'Mozilla/5.0 (Linux; Android 8.1.0; vivo 1716) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.92 Mobile Safari/537.36', '2019-10-07 16:14:11'),
(50, 6, '171.7.103.186', 'Mozilla/5.0 (Linux; Android 8.1.0; vivo 1716) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.92 Mobile Safari/537.36', '2019-10-07 16:14:21'),
(51, 7, '171.7.103.186', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.92 Safari/537.36', '2019-10-07 16:15:06'),
(52, 6, '66.249.65.191', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-10-09 12:53:24'),
(53, 1, '66.249.65.145', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-10-11 00:15:45'),
(54, 4, '66.249.65.241', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-10-11 08:55:06'),
(55, 3, '66.249.65.145', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-10-12 09:34:27'),
(56, 2, '66.249.65.245', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-10-12 17:31:16'),
(57, 3, '66.249.79.20', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-11-04 09:13:16'),
(58, 9, '125.25.4.85', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.87 Safari/537.36', '2019-11-05 01:58:25'),
(59, 4, '66.249.68.20', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-11-05 13:36:26'),
(60, 2, '66.249.68.20', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-11-05 13:37:51'),
(61, 10, '171.6.140.207', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.70 Safari/537.36', '2019-11-05 15:10:58'),
(62, 9, '171.6.140.207', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.70 Safari/537.36', '2019-11-05 15:12:12'),
(63, 11, '171.6.140.207', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.70 Safari/537.36', '2019-11-05 15:14:57'),
(64, 10, '171.6.140.207', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.70 Safari/537.36', '2019-11-05 15:21:42'),
(65, 3, '66.249.79.31', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-11-11 18:13:56'),
(66, 4, '66.249.79.31', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-11-11 19:05:21'),
(67, 11, '103.40.186.102', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.97 Safari/537.36', '2019-11-14 08:01:53'),
(68, 6, '202.151.41.77', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.97 Safari/537.36', '2019-11-14 09:31:29'),
(69, 1, '66.249.79.1', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-11-15 10:18:04'),
(70, 2, '36.71.232.14', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.97 Safari/537.36', '2019-11-15 23:13:50'),
(71, 7, '171.7.71.159', 'Mozilla/5.0 (Linux; Android 8.1.0; vivo 1716) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.96 Mobile Safari/537.36', '2019-11-17 03:00:01'),
(72, 10, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:00:05'),
(73, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:04'),
(74, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:04'),
(75, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:06'),
(76, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:06'),
(77, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:06'),
(78, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:44'),
(79, 1, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:46'),
(80, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:46'),
(81, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:47'),
(82, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:47'),
(83, 0, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:03:48'),
(84, 3, '105.156.56.122', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21', '2019-11-18 14:04:46'),
(85, 1, '66.249.75.70', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-11-22 03:21:17'),
(86, 11, '202.151.41.77', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36', '2019-11-26 08:03:54'),
(87, 11, '202.151.41.41', 'Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36', '2019-11-27 08:35:23'),
(88, 2, '66.249.75.254', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-11-28 21:21:10'),
(89, 2, '66.249.65.149', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-12-06 21:34:26'),
(90, 11, '192.99.225.97', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.102 Safari/537.36', '2019-12-14 06:19:25'),
(91, 10, '192.99.225.97', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:63.0) Gecko/20100101 Firefox/63.0', '2019-12-14 06:19:38'),
(92, 9, '192.99.225.97', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.102 Safari/537.36', '2019-12-14 06:19:53'),
(93, 7, '192.99.225.97', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:63.0) Gecko/20100101 Firefox/63.0', '2019-12-14 06:19:59'),
(94, 6, '66.249.65.147', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-12-15 05:45:09'),
(95, 2, '66.249.65.145', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-12-16 20:16:30'),
(96, 2, '66.249.71.67', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-12-22 08:51:11'),
(97, 1, '66.249.79.1', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-12-27 01:10:19'),
(98, 1, '66.249.68.18', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-12-28 18:58:49'),
(99, 2, '66.249.64.150', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2019-12-29 19:34:17'),
(100, 7, '104.238.250.88', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87 Safari/537.36', '2019-12-31 07:51:49'),
(101, 6, '104.238.250.88', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87 Safari/537.36', '2019-12-31 07:51:54'),
(102, 7, '184.168.46.103', 'Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.9.0.5) Gecko/2008120122 Firefox/3.0.5', '2019-12-31 17:28:50'),
(103, 7, '150.95.9.221', 'OreOreAgent', '2020-01-01 14:24:03'),
(104, 7, '109.199.100.241', '', '2020-01-01 14:24:10'),
(105, 7, '82.165.80.130', '', '2020-01-01 14:24:15'),
(106, 7, '184.168.46.103', 'Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; .NET CLR 1.1.4322; .NET CLR 2.0.50727; .NET CLR 3.0.04506.30)', '2020-01-01 14:24:19'),
(107, 6, '109.199.100.241', '', '2020-01-01 14:30:14'),
(108, 6, '184.168.46.103', 'Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; .NET CLR 1.1.4322; .NET CLR 2.0.50727; .NET CLR 3.0.04506.30)', '2020-01-01 14:31:24'),
(109, 3, '66.249.75.224', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-06 00:42:04'),
(110, 4, '66.249.75.91', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-06 00:51:50'),
(111, 3, '66.249.75.50', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-09 18:37:08'),
(112, 4, '66.249.69.24', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-09 19:19:17'),
(113, 7, '66.249.69.24', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-10 03:51:44'),
(114, 1, '66.249.71.154', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-20 12:06:07'),
(115, 1, '66.249.71.154', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-23 05:23:32'),
(116, 4, '66.249.71.67', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-24 09:55:37'),
(117, 3, '66.249.71.155', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-25 05:28:37'),
(118, 4, '66.249.71.95', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-27 01:57:06'),
(119, 3, '66.249.71.64', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-01-27 04:04:10'),
(120, 2, '66.249.65.241', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-02-05 23:19:09'),
(121, 4, '66.249.71.154', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-02-05 23:39:07'),
(122, 1, '66.249.71.67', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-02-05 23:58:53'),
(123, 7, '125.25.12.157', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.130 Safari/537.36', '2020-02-07 08:04:28'),
(124, 11, '125.25.12.157', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.130 Safari/537.36', '2020-02-07 08:05:16'),
(125, 10, '66.249.71.64', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-02-07 20:04:35'),
(126, 11, '66.249.71.95', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-02-10 22:33:03'),
(127, 9, '66.249.64.26', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-02-12 13:03:08'),
(128, 11, '124.120.218.41', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.130 Safari/537.36', '2020-02-12 15:08:36'),
(129, 9, '124.120.218.41', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.130 Safari/537.36', '2020-02-12 17:16:41'),
(130, 1, '66.249.71.132', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-02-14 01:14:18'),
(131, 1, '66.249.71.74', 'Mozilla/5.0 (Linux; Android 6.0.1; Nexus 5X Build/MMB29P) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2272.96 Mobile Safari/537.36 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)', '2020-02-14 04:45:02'),
(132, 11, '119.76.152.238', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.130 Safari/537.36', '2020-02-14 16:12:09'),
(133, 10, '119.76.152.238', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.130 Safari/537.36', '2020-02-14 16:12:16'),
(134, 9, '119.76.152.238', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.130 Safari/537.36', '2020-02-14 16:12:21');

-- --------------------------------------------------------

--
-- Table structure for table `carousel`
--

CREATE TABLE `carousel` (
  `id` int(11) NOT NULL,
  `img` varchar(255) COLLATE utf8_bin NOT NULL,
  `topic` varchar(11) COLLATE utf8_bin DEFAULT NULL,
  `detail` varchar(11) COLLATE utf8_bin DEFAULT NULL,
  `status` enum('true','false') COLLATE utf8_bin NOT NULL DEFAULT 'true'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Dumping data for table `carousel`
--

INSERT INTO `carousel` (`id`, `img`, `topic`, `detail`, `status`) VALUES
(9, 'klongri_26416504020190922_205920.jpg', '', '', 'true'),
(10, 'klongri_69687487720190922_205928.jpg', '', '', 'true'),
(11, 'klongri_151413113120190922_205934.jpg', '', '', 'true'),
(12, 'klongri_122262442520190922_205942.jpg', '', '', 'true'),
(15, 'klongri_145998362620191202_121312.jpg', '', '', 'true'),
(16, 'klongri_27180038620191202_121321.jpg', '', '', 'true');

-- --------------------------------------------------------

--
-- Table structure for table `klongri`
--

CREATE TABLE `klongri` (
  `id` int(11) NOT NULL,
  `number` varchar(255) COLLATE utf8_bin NOT NULL,
  `address` varchar(255) COLLATE utf8_bin NOT NULL,
  `map` text COLLATE utf8_bin NOT NULL,
  `home` text COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Dumping data for table `klongri`
--

INSERT INTO `klongri` (`id`, `number`, `address`, `map`, `home`) VALUES
(1, '081-181-2304', 'หมู่ 4 ต.ห้วยกรด อ.สรรคบุรี จ.ชัยนาท 17140', '<iframe class=\"map\"  src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3239.256455676737!2d100.21226225058241!3d15.095234532550052!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x0%3A0xcb24513074b3bdb5!2z4LiB4Lil4Li44LmI4Lih4LiI4Lix4LiB4Liq4Liy4LiZ4Lic4Lix4LiB4LiV4Lia4LiK4Lin4Liy4Lia4LmJ4Liy4LiZ4LiE4Lil4Lit4LiH4Lij4Li1!5e0!3m2!1sth!2sth!4v1566835381120!5m2!1sth!2sth\" frameborder=\"0\" style=\"border:0;\" allowfullscreen=\"\"></iframe>', '<div class=\"p-2\">\r\n<p style=\"text-align:center\"><u><span style=\"font-size:28px\"><strong>ประวัติความเป็นมาของชุมชนบ้านคลองรี่ ตำบลห้วยกรด</strong></span></u></p>\r\n\r\n<p style=\"text-align:center\">&nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><img alt=\"\" class=\"img-fluid\" src=\"https://www.klongri-ffs.com/klongri/admin/assets/image/klongri_69687487720190922_205928.jpg\" style=\"height:100%; width:100%\" /></p>\r\n\r\n<p style=\"text-align:justify\">&nbsp;</p>\r\n\r\n<p style=\"text-align:justify\"><span style=\"font-size:11pt\"><span style=\"font-family:Calibri,sans-serif\"><span style=\"font-size:16.0pt\">&nbsp;</span></span></span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ตำบลห้วยกรดเป็นตำบลหนึ่งที่อยู่ในอำเภอสรรคบุรี จังหวัดชัยนาท ซึ่งตามประวัติได้เล่าว่า มีพระธุดงค์ได้เดินทางมาจากทางทิศเหนือช่วงวันเพ็ญเดือนสาม เพื่อไปเทศกาลนมัสการรอยพระพุทธบาท จังหวัดสระบุรี&nbsp; มีพระธุดงค์กลุ่มหนึ่งได้ปักกรดอยู่ที่ชายป่าริมทุ่งหมู่บ้านแห่งหนึ่ง ตอนเช้าจะออกไปบิณฑบาตในหมู่บ้าน ซึ่งมีไม่กี่หลังคาเรือน และแต่ละหลังก็ตั้งอยู่บริเวณที่ห่างกันซึ่งพระกลุ่มนี้จะบิณฑบาตไปตามแนวคลองและจะข้ามฝากไปอีกด้านหนึ่ง ขณะที่ออกมาได้ระยะหนึ่ง พระธุดงค์ซึ่งเป็นผู้นำ นึกได้ว่าลืมกรดซึ่งห้อยแขวนไว้ที่ต้นกระทุ่ม จึงขอร้องให้พระทุกรูปรอสักครู่เพื่อกลับไปเอากรดที่ลืมไว้ แล้วจึงออกเดินทางพร้อมกัน สถานที่พระธุดงค์รอคอยมีชื่อว่า ศาลาคอยพระ ซึ่งในปัจจุบันมีหลักฐานเป็นศาลาพักร้อนขนดใหญ่ อยู่ริมทางด้านทิศตะวันออก ของวัดแม่มาหาลูก (วักมาติการาม) เหนือวัดช่องลม ชาวบ้านเรียกว่าศาลใต้ในวันสิ้นเดือนสามหรือกลางเดือนสี่ จะมีประเพณีตักบาตรข้าวหลามทุกปี สถานที่พระลืมห้อยกรดไว้ที่ต้นกระทุ่ม บริเวณทุ่งนากว้างได้ชื่อว่า นากระทุ่ม และหมู่บ้านก็ได้ชื่อว่าห้อยกรด สันนิษฐานว่าการเขียนพยัญชนะ อ กลายเป็น ว และออกเสียงควบกล่ำที่ผิดพลาดทำให้กลายเสียงไปเป็น ห้วยกรด</p>\r\n\r\n<p style=\"text-align:justify\">&nbsp;</p>\r\n\r\n<p style=\"text-align:justify\"><span style=\"font-size:11pt\"><span style=\"font-family:Calibri,sans-serif\"><strong><span style=\"font-size:18.0pt\"><img alt=\"\" class=\"img-fluid\" src=\"https://www.klongri-ffs.com/klongri/admin/assets/images/source/154247.jpg\" style=\"height:100%; width:100%\" /></span></strong></span></span></p>\r\n\r\n<p style=\"text-align:center\"><u><strong><span style=\"font-size:28px\">โรงเรียนชาวนาบ้านคลองรี่</span></strong></u></p>\r\n\r\n<p style=\"text-align:justify\">&nbsp; &nbsp; &nbsp; โรงเรียนชาวนาบ้านคลองรี่ หมู่4 ตำบลห้วยกรด อำเภอสรรคบุรี จังหวัดชัยนาท กำเนิดขึ้นประมาณปี พ.ศ 2556 โดยนายสุนทร มณฑาอดีตผู้ใหญ่บ้านบ้านคลองรี่ ซึ่งก่อนหน้านั้นได้ทำนาโดยใช้ปุ๋ยเคมีและสารเคมีกำจัดศัตรูพืช หลังจากที่ได้รับการอบรม โครงการโรงเรียนเกษตรกร ของสำนักงานเกษตรจังหวัดชัยนาท แล้วได้เกิดแรงบันดาลใจ และความตั้งใจในการทำนาแบบอินทรีย์ที่ไม่ใช้สารเคมี โดยมีนายสุวัฒน์ ทรัพยประภา เป็นที่ผู้สร้างแรงบันดาลใจนั้น หลังจากนั้นจึงได้จัดตั้งโรงเรียนชาวนาบ้านคลองรี่ขึ้น โดยรวบรวมชาวนาที่มีอุดมการณ์เดียวกันคือการทำนาอินทรีย์ เพื่อลดต้นทุนในการทำนา และเพื่อความยั่งยืนในอาชีพการทำนาอีกด้วย โดยมีนายสุวัฒน์ ทรัพยะประภา เป็นวิทยากรในการถ่ายทอดวามรู้</p>\r\n\r\n<p style=\"text-align:justify\">หลักสูตรที่ใช้ในการเรียนการสอนก็จะดำเนินตามรูปแบบที่ได้เคยรับการถ่ายทอด และจากการปฏิบัติที่ผ่านมา ส่วนการบริหารจัดการโรงเรียนชาวนานั้น มีการจัดตั้งกลุ่มบุคคลขึ้นมารับผิดชอบกันอย่างไม่เป็นทางการ ลักษณะการบริหารจัดการมีลักษณะเป็นแบบเครือญาติ หลักสูตรที่มีอยู่ในปัจจุบันนี้มี&nbsp;13 เรื่อง คือ</p>\r\n\r\n<p style=\"margin-left:160px\">1 การจัดการเรื่องดิน</p>\r\n\r\n<p style=\"margin-left:160px\">2 กระบวนการย่อยสลายทางชีวภาพ</p>\r\n\r\n<p style=\"margin-left:160px\">3 การเจริญเติบโตของพืช</p>\r\n\r\n<p style=\"margin-left:160px\">4 การจัดการธาตุอาหารของพืช</p>\r\n\r\n<p style=\"margin-left:160px\">5 การจัดการเมล็ดพันธุ์ข้าว</p>\r\n\r\n<p style=\"margin-left:160px\">6 ระบบนิเวศน์ในนาข้าว</p>\r\n\r\n<p style=\"margin-left:160px\">7 การจัดการแมลงศัตรูพืช</p>\r\n\r\n<p style=\"margin-left:160px\">8 การจัดการโรคพืช</p>\r\n\r\n<p style=\"margin-left:160px\">9 ฮอร์โมนพืช</p>\r\n\r\n<p style=\"margin-left:160px\">10 การบริหารจัดการน้ำ</p>\r\n\r\n<p style=\"margin-left:160px\">11 พัฒนาการของต้นข้าว</p>\r\n\r\n<p style=\"margin-left:160px\">12 วิธีการสกัดสมุนไพรและป้องกันแมลงศัตรูพืช</p>\r\n\r\n<p style=\"margin-left:160px\">13 วิธีการผลิตสารชีวภัณฑ์</p>\r\n</div>\r\n');

-- --------------------------------------------------------

--
-- Table structure for table `member`
--

CREATE TABLE `member` (
  `id` int(11) NOT NULL,
  `username` varchar(255) COLLATE utf8_bin NOT NULL,
  `password` varchar(255) COLLATE utf8_bin NOT NULL,
  `firstname` varchar(255) COLLATE utf8_bin NOT NULL,
  `lastname` varchar(255) COLLATE utf8_bin NOT NULL,
  `status` enum('member','admin') COLLATE utf8_bin NOT NULL DEFAULT 'member'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Dumping data for table `member`
--

INSERT INTO `member` (`id`, `username`, `password`, `firstname`, `lastname`, `status`) VALUES
(0, 'admin', '161ebd7d45089b3446ee4e0d86dbcf92', 'การัณย์', 'กะลันตะบุตร์', 'admin'),
(1, 'admin2', '161ebd7d45089b3446ee4e0d86dbcf92', 'การัณย์2', 'กะลันตะบุตร์', 'member');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `activities`
--
ALTER TABLE `activities`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `activities_ip`
--
ALTER TABLE `activities_ip`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `articles`
--
ALTER TABLE `articles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `articles_ip`
--
ALTER TABLE `articles_ip`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `carousel`
--
ALTER TABLE `carousel`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `klongri`
--
ALTER TABLE `klongri`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `activities`
--
ALTER TABLE `activities`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `activities_ip`
--
ALTER TABLE `activities_ip`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=84;

--
-- AUTO_INCREMENT for table `articles`
--
ALTER TABLE `articles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `articles_ip`
--
ALTER TABLE `articles_ip`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=135;

--
-- AUTO_INCREMENT for table `carousel`
--
ALTER TABLE `carousel`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `klongri`
--
ALTER TABLE `klongri`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `member`
--
ALTER TABLE `member`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
